Revit 2027 API
BuiltInFailures.PerformanceFailures.MultipleLoopsInSketch Property
 Sketch of <element> contains multiple independent loops - splitting it in few independent elements might improve performance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId MultipleLoopsInSketch { get; }
Public Shared ReadOnly Property MultipleLoopsInSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ MultipleLoopsInSketch {
	FailureDefinitionId^ get ();
}
static member MultipleLoopsInSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PerformanceFailures Class
Autodesk.Revit.DB Namespace